from customtkinter import *

def open_main_window():
    win = CTk()
    win.title("Attendify")
    win.geometry("350x600")
    win.resizable(False,False)
    label=CTkLabel(master=win,text="Ընտրիր քո դասարանը",font=("Times",16))
    label.pack()
        
    classes = {
        "10Ա դասարան": [
           "1.Արման Սարգսյան",
            "2.Նարեկ Մանուկյան",
            "3.Գոհար Ավագյան",
            "4.Լիլիթ Կարապետյան",
            "5.Դավիթ Հովհաննիսյան",
            "6.Մարիամ Սաֆարյան",
            "7.Արեն Ասատրյան",
            "8.Էլինա Մկրտչյան",
            "9.Հայկ Հակոբյան",
            "10.Սոֆիա Գրիգորյան",
            "11.Տիգրան Սահակյան",
            "12.Անահիտ Մարտիրոսյան",
            "13.Լևոն Աբրահամյան",
            "14.Անի Գևորգյան",
            "15.Ռոբերտ Քոչարյան",
            "16.Եվա Խաչատրյան",
            "17.Գարիկ Բաբայան",
            "18.Կարինա Հարությունյան",
            "19.Մուշեղ Մելիքյան",
            "20.Սիլվա Ալթունյան"
        ],
        "10Բ դասարան": [
            "1․Աբրահամյան Միքայել",
            "2.Գեւորգյան Նաիրա",
            "3.Հակոբյան Արման",
            "4.Պետրոսյան Մարիամ",
            "5.Գրիգորյան Դավիթ",
            "6.Սարգսյան Արփի",
            "7.Մկրտչյան Տիգրան",
            "8.Խաչատրյան Լիլիթ",
            "9.Հարությունյան Սարգիս",
            "10.Մանուկյան Էվա",
            "11.Ավետիսյան Կարեն",
            "12.Սիմոնյան Անուշ",
            "13.Մարտիրոսյան Ռոբերտ",
            "14.Թադեւոսյան Մարինե",
            "15.Բաղդասարյան Հայկ",
            "16.Կարապետյան Աննա",
            "17.Սահակյան Էրիկ",
            "18.Շահինյան Լաուրա",
            "19.Իսրայելյան Նարեկ",
            "20.Անդրեսյան Սոնա",
            "21.Չալիկյան Միքա",
            "22.Մելքումյան Սյուզի",
            "23.Ղազարյան Արմինե",
            "24.Կիրակոսյան Գոռ",
            "25.Տոնոյան Մարիա"
        ],
        "10Գ դասարան": [
            "1.Ալեքսանյան Նելլի",
            "2.Բաբայան Վահե",
            "3.Վարդանյան Մեգի",
            "4.Գալստյան Սևակ",
            "5.Դանիելյան Էլեն",
            "6.Եղոյան Արթուր",
            "7.Զաքարյան Լուսինե",
            "8.Թովմասյան Գարիկ",
            "9.Ժամկոչյան Արևիկ",
            "10.Իգիթյան Տիգրան",
            "11.Լեփեջյան Կարոլինա",
            "12.Խուրշուդյան Մարկ",
            "13.Ծիրանյան Ռուզաննա",
            "14.Կոստանյան Արեն",
            "15.Հարությունյան Մարիետա",
            "16.Ղուկասյան Լևոն",
            "17.Մարգարյան Սոֆի",
            "18.Նահապետյան Սեդրակ",
            "19.Շահբազյան Լիլի",
            "20.Ոսկանյան Նարե",
            "21.Պողոսյան Դանիել",
            "22.Ստեփանյան Գրիգոր"
        ]
    }

    def class_picker(choice):
        for widget in students_frame.winfo_children():
            # CTkRadioButton(win, text="Present", value="Present").place(x=100,y=200)
            # CTkRadioButton(win, text="Absent", value="Absent").place(x=75,y=140)
            widget.destroy()

        for student in classes[choice]:
            CTkButton(students_frame, text=student, font=("Times", 13)).pack(anchor="w", padx=10, pady=2)



    my_combo=CTkOptionMenu(win,values=list(classes.keys()),command=class_picker)
    my_combo.place(x=100,y=50)


    students_frame = CTkScrollableFrame(win, label_text="Աշակերտներ",width=320,height=200)
    students_frame.place(x=5,y=100)
    

    
        
    win.mainloop()
